app/views/events/_navbar.html.erb

SELECT "categories".* FROM "categories"
---
  <ul class=" navbar navbar-right">Categorias
    <% Category.all.each do |category| %>