app/views/events/show.html.erb

  <tbody>
    <% @event.interested_users.each do |int| %>
---
SELECT "user_interests".* FROM "user_interests" WHERE "user_interests"."event_id" = ?  [["event_id", 1]]