app/views/posts/index.html.erb


  <% if current_user && current_user.interested_events.count > 0 %>
---
SELECT "user_interests".* FROM "user_interests" WHERE "user_interests"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "user_interests" WHERE "user_interests"."user_id" = ?  [["user_id", 1]]