app/controllers/events_controller.rb

SELECT "categories".* FROM "categories"
SELECT "events".* FROM "events" WHERE (title || description || address LIKE '%Baladinha%')
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Restaurante"], ["LIMIT", 1]]
---
  def index
    if params[:category].blank?
      @events = Event.all
    else
      @category_id = Category.find_by(name: params[:category]).id

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_interests".* FROM "user_interests" WHERE "user_interests"."user_id" = ?  [["user_id", 1]]
---
  def my_events
    @events = []

    return unless current_user

    @events = current_user.interested_events.map { |interest| interest.event }

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "user_interests".* FROM "user_interests" WHERE "user_interests"."user_id" = 1 AND "user_interests"."event_id" = 1 ORDER BY "user_interests"."id" ASC LIMIT ?  [["LIMIT", 1]]
DELETE FROM "user_interests" WHERE "user_interests"."id" = ?  [["id", 1]]
---
  def unsubscribe

    u = User.find_by id: params[:user_id].to_i
    e = Event.find_by id: params[:event_id].to_i

    interest = UserInterest.where(user: u, event: e).first
    return unless interest

    respond_to do |format|

      if !interest.destroy

INSERT INTO "events" ("title", "description", "start_time", "end_time", "created_at", "updated_at", "latitude", "longitude", "address", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @event = Event.new(event_params)

    if(@event.category_id == nil)
      @event.category_id = 1
    end

    respond_to do |format|
      if @event.save