app/controllers/merits_controller.rb

	def index
		@merits = Merit.all
---
SELECT "merits".* FROM "merits"