app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Bom dia"], ["user_id", 1], ["created_at", "2017-11-29 20:15:50.724064"], ["updated_at", "2017-11-29 20:15:50.724064"]]
---
  def create
    @post = Post.new(post_params) do |post|
      post.user = current_user
    end
    if @post.save