app/controllers/reviews_controller.rb

	def create
		@review = Review.new(review_params)
		@review.event_id = @event.id
		@review.user_id = current_user.id

		if @review.save
---
INSERT INTO "reviews" ("rate", "commentary", "created_at", "updated_at", "user_id", "event_id") VALUES (?, ?, ?, ?, ?, ?)  [["rate", 5], ["commentary", "dads"], ["created_at", "2017-12-02 10:55:15.300671"], ["updated_at", "2017-12-02 10:55:15.300671"], ["user_id", 1], ["event_id", 1]]

		def find_event
			@event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]