app/controllers/user_interest_controller.rb

	def create
	  u = User.find params[:user_id]
	  e = Event.find params[:event_id]

	  @interest = UserInterest.new(user: u, event: e)
	  respond_to do |format|

	    if !UserInterest.create_interest(u, e)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "user_interests" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["event_id", 3], ["created_at", "2017-12-02 11:03:00.958753"], ["updated_at", "2017-12-02 11:03:00.958753"]]